package com.zmy.leetcode.lc47;

/**
 * @author : Agile Zhu
 * @packageName : com.zmy.leetcode.lc47
 * @projectName : project01
 * @date : 2020-06-17 12:41
 * @description :
 * 题目描述
 *
 * 给定一个二叉树，返回该二叉树层序遍历的结果，（从左到右，一层一层地遍历）
 * 例如：
 * 给定的二叉树是{3,9,20,#,#,15,7},
 * 3   /   9  20    /   15   7
 *
 * 该二叉树层序遍历的结果是
 *
 * [  [3],  [9,20],  [15,7]]
 *
 * 如果你不清楚“{1,#,2,3}"的含义的话，请继续阅读
 * 我们用如下方法将二叉树序列化：
 * 二叉树的序列化遵循层序遍历的原则，”#“代表该位置是一条路径的终结，下面不再存在结点。
 * 例如：
 *
 *    1  /  2   3    /   4      5
 *
 * 上述的二叉树序列化的结果是："{1,2,3,#,#,4,#,#,5}".
 **/
public class Solution {

}
